In [2]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Aman", "Saurav", "Karan", "Shubham", "Abhishek",
             "Rohit", "Priya", "Neha", "Arjun", None],
    
    "Department": ["IT", "Sales", "HR", "IT", "Finance",
                   "HR", "IT", "Sales", "Finance", "IT"],
    
    "Role": ["Developer", "Manager", "Analyst", "Developer", "Manager",
             "Analyst", "Developer", "Manager", "Analyst", "Developer"],
    
    "Experience": [2, 5, 3, 4, 6, 2, 1, 7, 5, 0],
    
    "Salary": [60000, 75000, 50000, 65000, 80000,
               52000, 58000, 90000, 72000, 45000],
    
    "Score": [4.5, 4.2, np.nan, 4.8, 4.1,
              3.9, 4.6, 4.3, 4.0, np.nan]
}

df = pd.DataFrame(data)

df

       Name Department       Role  Experience  Salary  Score
0      Aman         IT  Developer           2   60000    4.5
1    Saurav      Sales    Manager           5   75000    4.2
2     Karan         HR    Analyst           3   50000    NaN
3   Shubham         IT  Developer           4   65000    4.8
4  Abhishek    Finance    Manager           6   80000    4.1
5     Rohit         HR    Analyst           2   52000    3.9
6     Priya         IT  Developer           1   58000    4.6
7      Neha      Sales    Manager           7   90000    4.3
8     Arjun    Finance    Analyst           5   72000    4.0
9      None         IT  Developer           0   45000    NaN

In [4]:
# 1️⃣ Average Salary for each Department
df.groupby("Department")["Salary"].mean()

# 2️⃣ Average Performance Score for each Role
df.groupby("Role")["Score"].mean()

# 3️⃣ Non-null Performance Score count for each Department
df.groupby("Department")["Score"].count()

# 4️⃣ Total number of employee records in each Department (including missing values)
df.groupby("Department").size()

Department
Finance    2
HR         2
IT         4
Sales      2
dtype: int64

In [6]:
# Average Salary for each Department
df.groupby("Department")["Salary"].mean()

# Average Performance Score for each Role
df.groupby("Role")["Score"].mean()

# Non-null Performance Score count for each Department
df.groupby("Department")["Score"].count()

# Total number of employee records in each Department
df.groupby("Department").size()

Department
Finance    2
HR         2
IT         4
Sales      2
dtype: int64

In [7]:
# Salary summary (mean, max, min, count) by Department
df.groupby("Department")["Salary"].agg(["mean", "max", "min", "count"])

# Performance Score summary (mean, max, min, count) by Role
df.groupby("Role")["Score"].agg(["mean", "max", "min", "count"])

# Average Salary grouped by Department and Role
df.groupby(["Department", "Role"])["Salary"].mean()

# Average Performance Score grouped by Department and Experience
df.groupby(["Department", "Experience"])["Score"].mean()

Department  Experience
Finance     5             4.0
            6             4.1
HR          2             3.9
            3             NaN
IT          0             NaN
            1             4.6
            2             4.5
            4             4.8
Sales       5             4.2
            7             4.3
Name: Score, dtype: float64